#### Student’s Full Name: Anmol Tripathi
#### Course Title: SQL/NoSQL Databases for Data and Information Sciences
#### Term name and year: Fall 2023
#### Submission Week: 5
#### Instructor’s Name: Nayem Rahman
#### Date of Submission : 09/24/2023

In [2]:
import sqlite3
import pandas as pd

#### 1. Using the MySQL Workbench, create a database called Worker. The database must be named “Worker”.

In [3]:
Worker = "Worker.db"

In [4]:
conn = sqlite3.connect(Worker)

In [5]:
conn = sqlite3.connect('/Users/HP/OneDrive/Desktop/SQL/Worker.db')

In [6]:
%load_ext sql

In [7]:
%load_ext sql


%sql sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### 2. Create the Department table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type & length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented. (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the Department table by using the SELECT * statement and order by PK column(s).

In [8]:
%%sql

CREATE TABLE Department (
    DepartmentID TINYINT NOT NULL,
    DepartmentNm CHAR(30) NOT NULL,
    PRIMARY KEY (DepartmentID)
);

INSERT INTO Department (DepartmentID, DepartmentNm)
VALUES
    (1, 'Research & Development'),
    (2, 'Production'),
    (3, 'IT Support'),
    (4, 'Operations'),
    (5, 'Customer Service'),
    (6, 'Purchasing'),
    (7, 'Sales & Marketing'),
    (8, 'Human Resource Management'),
    (9, 'Accounting and Finance'),
    (10, 'Legal Department');

SELECT * FROM Department ORDER BY DepartmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
10 rows affected.
Done.

[(1, 'Research & Development'),
 (2, 'Production'),
 (3, 'IT Support'),
 (4, 'Operations'),
 (5, 'Customer Service'),
 (6, 'Purchasing'),
 (7, 'Sales & Marketing'),
 (8, 'Human Resource Management'),
 (9, 'Accounting and Finance'),
 (10, 'Legal Department')]

#### 3. Create the Employee table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type and length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented (not in a graphical view). (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the Employee table by using the SELECT * statement and order by PK column(s).

In [9]:
%%sql

CREATE TABLE Employee (
    EmployeeID INTEGER NOT NULL,
    DepartmentID TINYINT NOT NULL,
    FirstName VARCHAR(20) NOT NULL,
    LastName VARCHAR(20) NOT NULL,
    Address VARCHAR(50),
    PhoneNumberTxt VARCHAR(15),
    HireDate DATE NOT NULL,
    PRIMARY KEY (EmployeeID),
    FOREIGN KEY (DepartmentID) REFERENCES Department(DepartmentID)
);

INSERT INTO Employee (EmployeeID, DepartmentID, FirstName, LastName, Address, PhoneNumberTxt, HireDate)
VALUES
    (1, 2, 'Andy', 'Wong', '345 South Street', '(603) 555-6880', '2001-01-15'),
    (2, 1, 'John', 'Wilson', '560 Broadway', '(518) 555-6690', '2017-03-19'),
    (3, 3, 'Vivek', 'Pandey', '15 Mineral Drive', '(603) 555-4420', '2003-11-15'),
    (4, 7, 'Nola', 'Davis', '15 Long Ave', '(478) 555-8822', '2016-03-23'),
    (5, 8, 'Kathy', 'Cooper', '15 Hatter Drive', '(212) 555-9630', '2011-11-18'),
    (6, 9, 'Tom', 'Harper', '64 Highland Street', '(212) 555-7755', '2010-04-11');

SELECT * FROM Employee ORDER BY EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
6 rows affected.
Done.

[(1, 2, 'Andy', 'Wong', '345 South Street', '(603) 555-6880', '2001-01-15'),
 (2, 1, 'John', 'Wilson', '560 Broadway', '(518) 555-6690', '2017-03-19'),
 (3, 3, 'Vivek', 'Pandey', '15 Mineral Drive', '(603) 555-4420', '2003-11-15'),
 (4, 7, 'Nola', 'Davis', '15 Long Ave', '(478) 555-8822', '2016-03-23'),
 (5, 8, 'Kathy', 'Cooper', '15 Hatter Drive', '(212) 555-9630', '2011-11-18'),
 (6, 9, 'Tom', 'Harper', '64 Highland Street', '(212) 555-7755', '2010-04-11')]

#### 4. Create the Equipment table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type & length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented. (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the Equipment table by using the SELECT * statement and order by PK column(s).

In [9]:
%%sql

CREATE TABLE Equipment (
    EquipmentID INTEGER NOT NULL,
    EquipmentName VARCHAR(30) NOT NULL,
    EquipmentCostAmount DECIMAL(13,2),
    PRIMARY KEY (EquipmentID)
);

INSERT INTO Equipment (EquipmentID, EquipmentName, EquipmentCostAmount)
VALUES
    (1, 'Notebook Computers', 1000.00),
    (2, 'Headsets', 200.00),
    (3, 'Computer Monitor', 1500.00),
    (4, 'Multi-Function Printers', 800.00),
    (5, 'Projector or a Big Screen TV', 600.00),
    (6, 'Servers', 300.00),
    (7, 'Internet Modem', 250.00),
    (8, 'Cell Phone', 1200.00);

SELECT * FROM Equipment ORDER BY EquipmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
8 rows affected.
Done.

[(1, 'Notebook Computers', 1000),
 (2, 'Headsets', 200),
 (3, 'Computer Monitor', 1500),
 (4, 'Multi-Function Printers', 800),
 (5, 'Projector or a Big Screen TV', 600),
 (6, 'Servers', 300),
 (7, 'Internet Modem', 250),
 (8, 'Cell Phone', 1200)]

#### 5. Create the EmployeeEquipment table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type & length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented. (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the EmployeeEquipment table by using the SELECT * statement and order by PK column(s).

In [10]:
%%sql

CREATE TABLE EmployeeEquipment (
    EmployeeID INT NOT NULL,
    EquipmentID INT NOT NULL,
    PRIMARY KEY (EmployeeID, EquipmentID),
    FOREIGN KEY (EmployeeID) REFERENCES Employee(EmployeeID),
    FOREIGN KEY (EquipmentID) REFERENCES Equipment(EquipmentID)
);

INSERT INTO EmployeeEquipment (EmployeeID, EquipmentID)
VALUES
    (1, 1),
    (2, 1),
    (3, 1),
    (4, 1),
    (5, 1),
    (6, 1),
    (3, 2),
    (4, 2),
    (5, 2),
    (2, 3),
    (3, 3),
    (5, 3),
    (6, 3);

SELECT * FROM EmployeeEquipment ORDER BY EmployeeID, EquipmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
13 rows affected.
Done.

[(1, 1),
 (2, 1),
 (2, 3),
 (3, 1),
 (3, 2),
 (3, 3),
 (4, 1),
 (4, 2),
 (5, 1),
 (5, 2),
 (5, 3),
 (6, 1),
 (6, 3)]

#### 6. Create the Training table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type & length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented. (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the Training table by using the SELECT * statement and order by PK column(s).

In [11]:
%%sql

CREATE TABLE Training (
    TrainingID INT NOT NULL,
    TrainingName VARCHAR(50) NOT NULL,
    PRIMARY KEY (TrainingID)
);

INSERT INTO Training (TrainingID, TrainingName)
VALUES
    (1, 'COVID-19 Awareness and Protection Training'),
    (2, 'Code of Conduct Training'),
    (3, 'Safety Training'),
    (4, 'Intro to Python'),
    (5, 'Machine Learning'),
    (6, 'Microsoft Certifications'),
    (7, 'Security and Privacy'),
    (8, 'Product Knowledge'),
    (9, 'Sales Skills'),
    (10, 'Employee Relations'),
    (11, 'Travel and Expense Management');

SELECT * FROM Training ORDER BY TrainingID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
11 rows affected.
Done.

[(1, 'COVID-19 Awareness and Protection Training'),
 (2, 'Code of Conduct Training'),
 (3, 'Safety Training'),
 (4, 'Intro to Python'),
 (5, 'Machine Learning'),
 (6, 'Microsoft Certifications'),
 (7, 'Security and Privacy'),
 (8, 'Product Knowledge'),
 (9, 'Sales Skills'),
 (10, 'Employee Relations'),
 (11, 'Travel and Expense Management')]

#### 7. Create the EmployeeTraining table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type & length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented. (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the EmployeeTraining table by using the SELECT * statement and order by PK column(s).

In [12]:
%%sql

CREATE TABLE EmployeeTraining (
    EmployeeID INTEGER NOT NULL,
    TrainingID INTEGER NOT NULL,
    PRIMARY KEY (EmployeeID, TrainingID),
    FOREIGN KEY (EmployeeID) REFERENCES Employee (EmployeeID),
    FOREIGN KEY (TrainingID) REFERENCES Training (TrainingID)
);

INSERT INTO EmployeeTraining (EmployeeID, TrainingID)
VALUES
    (1, 2),
    (2, 2),
    (3, 2),
    (4, 2),
    (5, 2),
    (6, 2),
    (5, 10),
    (2, 4),
    (2, 5),
    (3, 6),
    (4, 8),
    (1, 3),
    (4, 9),
    (3, 7),
    (6, 11);

SELECT * FROM EmployeeTraining ORDER BY EmployeeID, TrainingID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
15 rows affected.
Done.

[(1, 2),
 (1, 3),
 (2, 2),
 (2, 4),
 (2, 5),
 (3, 2),
 (3, 6),
 (3, 7),
 (4, 2),
 (4, 8),
 (4, 9),
 (5, 2),
 (5, 10),
 (6, 2),
 (6, 11)]

#### 8. Create the Trainer table in the Worker database (table must be based on Physical Model Provided in the Assignment folder). (a) Columns, Primary Key (PK), Data Type & length, and NULL/NOT NULL need to be implemented, as provided in the Physical Model. (b) Show the table definition (DDL) that you implemented. (c) Insert the complete set of data provided in the Excel file (uploaded in the Assignment folder) and show the insert statements used. (d) Retrieve the data from the Trainer table by using the SELECT * statement and order by PK column(s).

In [13]:
%%sql

CREATE TABLE Trainer (
    TrainerID INTEGER NOT NULL,
    TrainingID INTEGER NOT NULL,
    TrainerFirstName VARCHAR(20) NOT NULL,
    TrainerLastName VARCHAR(20) NULL,
    PRIMARY KEY (TrainerID),
    FOREIGN KEY (TrainingID) REFERENCES Training (TrainingID)
);

INSERT INTO Trainer (TrainerID, TrainingID, TrainerFirstName, TrainerLastName)
VALUES
    (1, 1, 'James', 'Smith'),
    (2, 1, 'Johnny', 'Khor'),
    (3, 2, 'Michael', 'Smith'),
    (4, 3, 'Maria', 'Garcia'),
    (5, 4, 'John', NULL),
    (6, 4, 'Paul', 'Deitel'),
    (7, 5, 'Mike', 'Taylor'),
    (8, 5, 'Avinash', 'Navlani'),
    (9, 6, 'Robert', 'Smith'),
    (10, 7, 'Maria', 'Rodriguez'),
    (11, 8, 'Mike', 'Donlon'),
    (12, 9, 'Kathy', 'Corby'),
    (13, 10, 'Mary', 'Garcia'),
    (14, 10, 'Vanessa', NULL),
    (15, 11, 'Jordan', NULL),
    (16, 11, 'Maria', 'Hernandez');

SELECT * FROM Trainer ORDER BY TrainerID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.
16 rows affected.
Done.

[(1, 1, 'James', 'Smith'),
 (2, 1, 'Johnny', 'Khor'),
 (3, 2, 'Michael', 'Smith'),
 (4, 3, 'Maria', 'Garcia'),
 (5, 4, 'John', None),
 (6, 4, 'Paul', 'Deitel'),
 (7, 5, 'Mike', 'Taylor'),
 (8, 5, 'Avinash', 'Navlani'),
 (9, 6, 'Robert', 'Smith'),
 (10, 7, 'Maria', 'Rodriguez'),
 (11, 8, 'Mike', 'Donlon'),
 (12, 9, 'Kathy', 'Corby'),
 (13, 10, 'Mary', 'Garcia'),
 (14, 10, 'Vanessa', None),
 (15, 11, 'Jordan', None),
 (16, 11, 'Maria', 'Hernandez')]

#### 9. Retrieve the data from the Trainer table by using the SELECT * statement with filter, WHERE TrainerLastName IS NULL.

In [14]:
%%sql

SELECT *
FROM Trainer
WHERE TrainerLastName IS NULL
ORDER BY TrainerID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(5, 4, 'John', None), (14, 10, 'Vanessa', None), (15, 11, 'Jordan', None)]

#### 10. By using the SHOW tables statements, show the list of tables you have created in the Worker database.

In [15]:
%%sql

SELECT name
FROM sqlite_master
WHERE type='table';

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('Department',),
 ('Employee',),
 ('EmployeeEquipment',),
 ('Training',),
 ('EmployeeTraining',),
 ('Trainer',)]